{"data": [{"title": "Curiosidade para o dia 29 de janeiro:", "value": "Em 1886, o engenheiro alemão carl benz dava entrada na patente do veículo movido por motor a gás, considerada hoje como a “certidão de nascimento” do automóvel. e após as notícias de hoje: programa de estágio em uma das poucas empresas no mundo que une tecnologia e saúde, e um depoimento no meu curso de programação para quem estuda em casa ou sozinho e sente que está enrolando/perdendo tempo."}, {"title": "Pesquisa encontra “pressão descendente na qualidade do código” escrito pelo GitHub Copilot:", "value": "O estudo analisou 153 milhões de linhas de código, identificando “tendências desconcertantes” para a manutenção de uma base no longo prazo. foram encontradas correlações com a quantidade de código escrito com assistentes de ia e linhas que são revertidas ou atualizadas menos de duas semanas após serem criadas, e uma tendência crescente nas adições de código, sugerindo uma redução do reaproveitamento e refatoração. as informações são do site visual studio magazine."}, {"title": "Inspeção do código-fonte das urnas eletrônicas para as Eleições Municipais de 2024 começa nesta segunda-feira:", "value": "Um representante da sociedade brasileira de computação irá conferir os sistemas eleitorais visitando o tribunal superior eleitoral em brasília. a abertura do código-fonte da urna é um procedimento obrigatório e realizado pelo tse um ano antes de cada eleição. as informações são do site convergência digital."}, {"title": "Para Mozilla, regras para adoção de novas engines em navegadores no iOS na Europa são “decepcionantes” e as mais “dolorosas possíveis”:", "value": "As restrições impostas pela apple forçarão navegadores independentes a manter duas implementações distintas – webkit e gecko, por exemplo – o que pode não ser viável para o firefox. a spotify também criticou as novas regras referentes a lojas de aplicativos de terceiros e comissões sobre assinaturas e venda de aplicativos, afirmando que as mudanças anunciadas pela apple são uma “extorsão” e “completa farsa” sob o falso pretexto de cumprimento da lei. as informações são do site the verge."}, {"title": "Nvidia detém entre 70% e 90% do mercado de chips aceleradores de IA:", "value": "E apesar do destaque em relação ao hardware, software continua sendo o diferencial estratégico da empresa frente aos concorrentes com o cuda toolkit, um ambiente de desenvolvimento para a criação de aplicativos de alto desempenho em gpus. atualmente, 80% da receita da companhia vem de chips de ia para data centers e o segmento de gpus para jogos contribui com apenas 16%. as informações são do site yahoo! finance."}, {"title": "Escrita à mão promove o aprendizado de forma mais eficaz do que digitação em teclados:", "value": "O estudo analisou os dados eletroencefalográficos de 36 universitários, mostrando diferenças significativas nas conexões cerebrais envolvidas na formação da memória e codificação de novas informações, evidenciando a importância de se compreender as implicações da substituição gradual da escrita manual por dispositivos digitais. as informações são do site the register."}, {"title": "Rumores apontam que o iOS 18 promete receber a “maior” atualização desde o lançamento do iPhone:", "value": "De codinome crystal, o sistema operacional incluirá uma versão aprimorada da siri com um modelo de linguagem e integração por todo o sistema operacional. o código do ios 17.4 sugere que a apple está testando diferentes modelos de ia, chamados internamente de “ajax”, com processamento local e também na nuvem. além disso, o xcode – ide para desenvolvimento de aplicativos para dispositivos da marca – contará com um assistente de código. a expectativa é que as novidades sejam anunciadas na conferência de desenvolvedores wwdc prevista para junho deste ano. as informações são do site 9to5mac."}, {"title": "Lançamento do Programa de Estágio Philips Desenvolve Tech 2024:", "value": "Uma oportunidade única para estudantes de ti e desenvolvimento de software! começando em abril, este programa oferece a chance de integrar a equipe de software e suporte técnico da philips, colaborando globalmente e contribuindo para melhorar milhões de vidas. envolva-se em um ambiente de aprendizado acelerado com atividades práticas diárias, preparando-se para um futuro brilhante na tecnologia. inscrições abrem em janeiro – não perca a chance de se desenvolver com a philips: link patrocinado"}, {"title": "“Eu tenho muita dificuldade em aprender sozinha, sempre sinto que estou deixando passar conheciemntos teóricos importantes, como por exemplo explicar para alguém ou em uma entrevista”:", "value": "Assim começa o depoimento da aluna “alinecorrea” no curso.dev. “quando comecei a estudar programação de casa, me sentia perdendo tempo ou maquiando meu aprendizando por não ter um caminho de foco no aprendizado. esse curso é de longe o que mais tem me ensinado sobre a área, a explicação do filipe é tão clara, ele faz analogias tão simples que dificilmente eu fico com dúvida das expicações. a didática é surreal, até quando da erro em algo eu consigo resolver sozinha por ter entendido todo o conteúdo passado. tenho certeza que serei uma profissional completa com esse curso. com certeza valeu o investimento”: link do curso"}]}