{"data": [{"title": "Curiosidade para o dia 30 de janeiro:", "value": "Em 2007, a microsoft lançava o windows vista para o público, frequentemente descrito como uma das piores versões do sistema operacional. e após as notícias de hoje: camiseta feita de um tecido com características muito interessantes e um bootcamp gratuito para obter certificação azure ai-900."}, {"title": "Meta lança Code Llama 70B:", "value": "O novo modelo, treinado em 1 tb de código, está disponível gratuitamente para uso comercial ou pesquisa. há duas versões extras disponíveis – uma especializada em python e outra com ajuste fino para entender instruções em linguagem natural. o code llama 70b supera as versões anteriores, com 53% de acerto no benchmark humaneval, superando o gpt-3.5 (48%) e aproximando-se do gpt-4 (67%). as informações são do site the verge."}, {"title": "Pagamento de resgates em ataques de ransomware cai para um mínimo recorde no último trimestre de 2023:", "value": "Apenas 29% das vítimas decidiram pagar os valores de extorsão requeridos pelos criminosos – em 2019, essa taxa era de 85%. o declínio se deve a uma maior preparação das empresas, desconfiança das promessas de não publicação dos dados roubados e pressão legal em alguns países, nos quais pagar resgate é ilegal. o valor médio dos pagamentos também caiu, para uma média de 568 mil dólares, uma redução de 33% na comparação com o trimestre anterior. as informações são do site bleeping computer."}, {"title": "Anatel estuda criar uma nova “taxa de rede” para grandes empresas de tecnologia no Brasil:", "value": "A intenção seria distribuir os custos de infraestrutura entre big techs, como meta e google, e as operadoras de telefonia. contudo, um estudo citado pela própria anatel indica que as operadoras no brasil mantêm boas margens financeiras, questionando a validade das reclamações sobre insuficiência de fundos para manter e expandir a infraestrutura de rede. as informações são do site convergência digital."}, {"title": "Quarta rodada de negociação salarial entre sindicato de trabalhadores de TI e patronal de SP termina sem acordo:", "value": "Há discordâncias sobre o valor do reajuste salarial e do vale-refeição. o sindpd/sp, representante dos trabalhadores, propôs aumento de 4,7% para 2024 e “inpc + 1%” para 2025, com aumento do vale-refeição de 30 reais para 2024 e 35 reais para 2025. as empresas, representadas pelo seprosp, oferecem reajuste de 4% para 2024 e do inpc para 2025, mantendo o vale-refeição em 25 reais para 2024 e um reajuste de inpc + 1 real para o próximo ano. as informações são do site convergência digital."}, {"title": "Neuralink implanta, com sucesso, primeiro chip cerebral em um humano:", "value": "O paciente está se recuperando bem, com “promissora detecção” de atividade neuronal. o objetivo do estudo prime é avaliar a segurança e a funcionalidade de uma interface cérebro-computador sem fio, possibilitando que pessoas quadriplégicas controlem dispositivos através do pensamento – o primeiro produto da neuralink irá se chamar “telepathy”. as informações são da reuters."}, {"title": "ICANN propõe a criação do TLD “.INTERNAL”:", "value": "O novo domínio de topo serviria para uso interno exclusivo, similar ao bloco ipv4 192.168.x.x, que não é conectado à internet aberta. o.internal foi escolhido em detrimento ao .private por causa da possibilidade de criar uma impressão errada sobre a privacidade de dados e com maior potencial para significados conflitantes em outros idiomas. as informações são do site the register."}, {"title": "Transforme seu guarda-roupa com a Tech T-shirt da Insider, uma camiseta inovadora que se destaca no mercado:", "value": "Com sua tecnologia exclusiva, ela não desbota, desamassa no corpo e possui ação anti-odor, elevando o padrão de conforto e durabilidade. disponível em uma ampla variedade de tamanhos, do p ao xxgg, e em diversas cores, há uma opção perfeita para cada estilo. explore as possibilidades e encontre a sua favorita. utilize o cupom news12 para obter 12% de desconto em toda a loja insider: link patrocinado"}, {"title": "Conquiste sua Certificação Azure AI-900 e destaque o seu currículo para o mercado! O Bootcamp Microsoft Azure AI Fundamentals está com inscrições abertas, totalmente gratuitas e um conteúdo 100% inédito na plataforma DIO! Essa é para quem quer dominar conceitos como visão computacional, classificação inteligente de imagem e inteligência de documentos com IA enquanto se familiariza com as tecnologias da Microsoft Azure para ganhar velocidade e performance em suas aplicações. A Microsoft também vai presentear 700 pessoas durante o programa com vouchers gratuitos para o exame. Bateu com o seu perfil? Se inscreve lá pelo link:", "value": "Link patrocinado"}]}